Reports/ИспользованиеСчетовИСубконтоМеждународныйУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Report>
		<Properties>
			<Name>ИспользованиеСчетовИСубконтоМеждународныйУчет</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ЗначенияСубконто</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидСубконто</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/ИспользованиеСчетовИСубконтоМеждународныйУчет/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Для общей формы "Форма отчета" подсистемы "Варианты отчетов".
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.ВыводитьСуммуВыделенныхЯчеек = Ложь;
	Настройки.События.ПриСозданииНаСервере = Истина;
	Настройки.Вставить("РазрешеноИзменятьВарианты", Ложь);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыОтчета = Неопределено;
	ВнешниеНаборыДанных = ЭлементыОтчетности(ПараметрыОтчета);
	
	// Подготовим и выведем отчет.
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	НастройкиКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(
		СхемаКомпоновкиДанных, 
		НастройкиКомпоновкиДанных,
		ДанныеРасшифровки);
		
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	//ВнешниеНаборыДанных = Новый Структура("ТаблицаЭлементов", ТаблицаЭлементов);
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.НачатьВывод();
	ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
	ПроцессорВывода.ЗакончитьВывод();
	
	ФиксацияСтрокСверху = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ФиксацияСтрокСверху");
	Если ФиксацияСтрокСверху <> Неопределено Тогда
		ДокументРезультат.ФиксацияСверху = ФиксацияСтрокСверху.Значение;
	КонецЕсли;
	
	ФиксацияСтрокСлева = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ФиксацияСтрокСлева");
	Если ФиксацияСтрокСверху <> Неопределено Тогда
		ДокументРезультат.ФиксацияСлева = ФиксацияСтрокСлева.Значение;
	КонецЕсли;
	
	Для Каждого Параметр Из ПараметрыОтчета Цикл
		Если НЕ ЗначениеЗаполнено(Параметр.Значение) Тогда
			ОбластьПараметра = ДокументРезультат.НайтиТекст(Параметр.Представление);
			Если ОбластьПараметра <> Неопределено Тогда
				СтрокаМакета = ДокументРезультат.Область(ОбластьПараметра.Верх,ОбластьПараметра.Лево,ОбластьПараметра.Верх);
				ДокументРезультат.УдалитьОбласть(СтрокаМакета, ТипСмещенияТабличногоДокумента.ПоВертикали);
			КонецЕсли;;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЭлементыОтчетности(ПараметрыОтчета)
	
	Перем Счет,ВидСубконто,ЗначениеСубконто;
	
	ПараметрыОтчета = Новый СписокЗначений;
	
	Параметр = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "СчетПланаСчетов");
	Если Параметр <> Неопределено Тогда
		Счет = Параметр.Значение;
	КонецЕсли;
	ПараметрыОтчета.Добавить(Счет, НСтр("ru='Счет';uk='Рахунок'")+": ");
	
	Параметр = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ВидСубконто");
	Если Параметр <> Неопределено Тогда
		ВидСубконто = Параметр.Значение;
	КонецЕсли;
	ПараметрыОтчета.Добавить(ВидСубконто, НСтр("ru='Вид субконто';uk='Вид субконто'")+": ");
	
	Параметр = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ЗначениеСубконто");
	Если Параметр <> Неопределено Тогда
		ЗначениеСубконто = Параметр.Значение;
		КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек,"ЗначениеСубконто",ЗначениеСубконто);
	КонецЕсли;
	ПараметрыОтчета.Добавить(ЗначениеСубконто, НСтр("ru='Субконто';uk='Субконто'")+": ");
	
	// Проверим, указано ли что-нибудь для поиска
	Если НЕ ЗначениеЗаполнено(Счет)
		И НЕ ЗначениеЗаполнено(ВидСубконто)
		И НЕ ЗначениеЗаполнено(ЗначениеСубконто) Тогда
		ВызватьИсключение НСтр("ru='Отчет не сформирован. Необходимо выбрать счет, вид субконто или значение субконто.';uk='Звіт не сформований. Необхідно вибрати рахунок, вид субконто, або значення субконто.'") ;
	КонецЕсли;
	
	Использование = ?(ЗначениеЗаполнено(Счет) И ТипЗнч(Счет) = РеглУчетКлиентСервер.ТипПланСчетов(), Ложь, Истина);
	КомпоновщикНастроек.Настройки.Структура[1].Использование = Использование;
	
	Схема = ПолучитьМакет("ПоказателиОтчетов");
	Компоновщик = ФинансоваяОтчетностьСервер.КомпоновщикСхемы(Схема);
	Если ЗначениеЗаполнено(Счет) Тогда
		КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Компоновщик,"СчетПланаСчетов",Счет);
	КонецЕсли;
	Если ЗначениеЗаполнено(ВидСубконто) Тогда
		КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Компоновщик,"ВидСубконто",ВидСубконто);
	КонецЕсли;
	Если ЗначениеЗаполнено(ЗначениеСубконто) Тогда
		КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Компоновщик,"ЗначениеСубконто",ЗначениеСубконто);
	КонецЕсли;
	ЭлементыОтчетов = ФинансоваяОтчетностьСервер.ВыгрузитьРезультатСКД(Схема, Компоновщик);
	
	Схема = ПолучитьМакет("ШаблоныПроводок");
	Компоновщик = ФинансоваяОтчетностьСервер.КомпоновщикСхемы(Схема);
	Если ЗначениеЗаполнено(Счет) Тогда
		КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Компоновщик,"Счет",Счет);
	КонецЕсли;
	Если ЗначениеЗаполнено(ВидСубконто) Тогда
		КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Компоновщик,"ВидСубконто",ВидСубконто);
	КонецЕсли;
	Если ЗначениеЗаполнено(ЗначениеСубконто) Тогда
		КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Компоновщик,"ЗначениеСубконто",ЗначениеСубконто);
	КонецЕсли;
	ТаблицаШаблонов = ФинансоваяОтчетностьСервер.ВыгрузитьРезультатСКД(Схема, Компоновщик);
	
	ВнешниеНаборыДанных = Новый Структура("ТаблицаЭлементов, ТаблицаШаблонов", ЭлементыОтчетов, ТаблицаШаблонов);
	
	Возврат ВнешниеНаборыДанных;
	
КонецФункции

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//   ЭтаФорма - ФормаКлиентскогоПриложения - Форма отчета.
//   Отказ - Булево - Передается из параметров обработчика "как есть".
//   СтандартнаяОбработка - Булево - Передается из параметров обработчика "как есть".
//
// См. также:
//   "ФормаКлиентскогоПриложения.ПриСозданииНаСервере" в синтакс-помощнике.
//
Процедура ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка) Экспорт
	
	Параметры = ЭтаФорма.Параметры;
	
	Если Параметры.Свойство("ПараметрКоманды") Тогда
		
		НастройкиОтчета = НастройкиОтчета(Параметры.ПараметрКоманды);
		
		Параметры.ПользовательскиеНастройки = НастройкиОтчета.ПользовательскиеНастройки;
		Параметры.ФиксированныеНастройки = НастройкиОтчета.ФиксированныеНастройки;
		ЭтаФорма.ФормаПараметры.ФиксированныеНастройки = НастройкиОтчета.ФиксированныеНастройки;
		
	КонецЕсли;
	
КонецПроцедуры

Функция НастройкиОтчета(Счет)
	
	// Настройки контекстного отчета
	КомпоновщикНастроекДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
	ИмяСхемы = Метаданные.Отчеты.ИспользованиеСчетовИСубконтоМеждународныйУчет.ОсновнаяСхемаКомпоновкиДанных.Имя;
	СхемаОтчета = Отчеты.ИспользованиеСчетовИСубконтоМеждународныйУчет.ПолучитьМакет(ИмяСхемы);
	НастройкиВарианта = СхемаОтчета.ВариантыНастроек.ИспользованиеСчетаКонтекст.Настройки;
	КомпоновщикНастроекДанных.ЗагрузитьНастройки(НастройкиВарианта);
	ПользовательскиеНастройки = КомпоновщикНастроекДанных.ПользовательскиеНастройки;
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ЭтоМеждународный", Истина);
	
	// Установим параметры контекстного отчета
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(ПользовательскиеНастройки, "СчетПланаСчетов", Счет);
	
	Возврат КомпоновщикНастроекДанных;
	
КонецФункции

#КонецОбласти

#КонецЕсли
